examples/yeast_radially_symmetric_nutrient_eating_rate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (   6.24405138488661  -0.27262117103335                  0 )  // 0 v1-y
    (                  0                  0                  0 )  // 1 v0-y : v0+y v0-y
    (   6.24405138488661   0.27262117103335                  0 )  // 2 v1+y
    (   6.24405138488661  -0.27262117103335                  1 )  // 3 v2-y
    (                  0                  0                  1 )  // 4 v3-y : v3+y v3-y
    (   6.24405138488661   0.27262117103335                  1 )  // 5 v2+y
);

edges
(
);

blocks
(
    hex (1 0 2 1 4 3 5 4) b0 (300 1 300) simpleGrading (0.1 ( ( 0.2 0.3 4 ) ( 0.6 0.4 1 ) ( 0.2 0.3 0.25 ) ) 1)  // b0 (v0-y v1-y v1+y v0+y v3-y v2-y v2+y v3+y)
);

boundary
(
    back_sym
    {
        type wedge;
        faces
        (
            (2 1 4 5)  // f-b0-n (v1+y v0+y v3+y v2+y)
        );
    }
    right_sym
    {
        type wedge;
        faces
        (
            (1 0 3 4)  // f-b0-s (v0-y v1-y v2-y v3-y)
        );
    }
    top_petri
    {
        type patch;
        faces
        (
            (4 3 5 4)  // f-b0-t (v3-y v2-y v2+y v3+y)
        );
    }
    bottom_petri
    {
        type patch;
        faces
        (
            (1 1 2 0)  // f-b0-b (v0-y v0+y v1+y v1-y)
        );
    }
    petri_outer
    {
        type wall;
        faces
        (
            (0 2 5 3)  // f-b0-n (v1-y v1+y v2+y v2-y)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (1 4 4 1)  // f-b0-w (v0-y v3-y v3+y v0+y)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
