examples/yeast_radially_symmetric_nutrient_eating_rate/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object transportProperties;
}

    materialName dimensionless;
    Ra Ra [0 4 -2 0 -1 0 0] 100.;
    //Ra Ra [0 4 -2 0 -1 0 0] 0.; // to start
